Problem 1: Create and Inspect
Create a DataFrame named student_data with the following data:
Columns: ['Name', 'Age', 'Grade', 'City']
Rows:
Alice, 22, A, London
Bob, 21, B, New York
Charlie, 23, A+, Paris
Diana, 20, B+, Tokyo

After creating it, write code to display only the Name and City columns for all students.

In [2]:
import pandas as pd

In [3]:
student_data = {
    "Name" : ["Alice","Bob","Charlie","Diana"],
    "Age" : [22, 21, 23, 20],
    "Grade" : ["A", "B", "A+", "B+"],
    "City" : ["London", "New York", "Paris", "Tokyo"]
}
df = pd.DataFrame(student_data)
df

      Name  Age Grade      City
0    Alice   22     A    London
1      Bob   21     B  New York
2  Charlie   23    A+     Paris
3    Diana   20    B+     Tokyo

In [7]:
df[['Name','City']]

      Name      City
0    Alice    London
1      Bob  New York
2  Charlie     Paris
3    Diana     Tokyo

Problem 2: Basic Filtering (Single Condition)
Using the student_data DataFrame from Problem 1, filter and display all students who have a grade of 'A' or 'A+'.
(Hint: You might need to use the logical OR operator | or the .isin() method).

In [10]:
filt = (df['Grade']=='A') | (df['Grade'] == 'A+')
df[filt]

      Name  Age Grade    City
0    Alice   22     A  London
2  Charlie   23    A+   Paris

Problem 3: Complex Filtering (Multiple Conditions)
Using the student_data DataFrame, filter and display all students who are older than 21 AND are from either 'London' or 'Paris'.
(Hint: You will need to use parentheses () to group your conditions correctly with the logical AND & and OR | operators).

In [13]:
filt2 = ((df['Age'] > 21) & ((df['City'] == 'London') | (df['City'] == 'Paris')))
df[filt2]

      Name  Age Grade    City
0    Alice   22     A  London
2  Charlie   23    A+   Paris

Problem 4: Setting and Resetting Index
Take the student_data DataFrame and set the 'Name' column as the new index.
Display the DataFrame to confirm the change.
Now, reset the index so that the 'Name' becomes a regular column again and the DataFrame has the default integer index. Display the result.

In [14]:
df.set_index('Name', inplace=True)
df

         Age Grade      City
Name
Alice     22     A    London
Bob       21     B  New York
Charlie   23    A+     Paris
Diana     20    B+     Tokyo

In [16]:
df.reset_index(inplace=True)
df

   index     Name  Age Grade      City
0      0    Alice   22     A    London
1      1      Bob   21     B  New York
2      2  Charlie   23    A+     Paris
3      3    Diana   20    B+     Tokyo

Problem 5: Conditional Selection with .loc[]
Using the student_data DataFrame with the 'Name' column set as its index (as in Problem 4.1):
- Use .loc[] to select the row of data for the student named 'Diana'.
- Use .loc[] to select the 'Age' and 'City' for the student named 'Bob'.
- Use .loc[] with a conditional to select all rows where the index (the student's name) starts with the letter 'C'. (Hint: You can use .index and the .str.startswith() method inside the .loc[] condition).

In [17]:
df.set_index('Name', inplace=True)
df

         index  Age Grade      City
Name
Alice        0   22     A    London
Bob          1   21     B  New York
Charlie      2   23    A+     Paris
Diana        3   20    B+     Tokyo

In [22]:
# - Use .loc[] to select the row of data for the student named 'Diana'
df.loc['Diana']

index        3
Age         20
Grade       B+
City     Tokyo
Name: Diana, dtype: object

In [23]:
# - Use .loc[] to select the 'Age' and 'City' for the student named 'Bob'.
df.loc['Bob', ['Age','City']]

Age           21
City    New York
Name: Bob, dtype: object

In [29]:
df

         index  Age Grade      City
Name
Alice        0   22     A    London
Bob          1   21     B  New York
Charlie      2   23    A+     Paris
Diana        3   20    B+     Tokyo

In [36]:
# - Use .loc[] with a conditional to select all rows where the index (the student's name) starts with the letter 'C'. 
#(Hint: You can use .index and the .str.startswith() method inside the .loc[] condition).
filt3 = df.index.str.startswith('C')
df.loc[filt3, :] # The colon ':' means "all columns"
# df.loc[filt3] will print the same thing

         index  Age Grade   City
Name
Charlie      2   23    A+  Paris